Revit 2027 API
RevitLinkType.Create Method
Overload List
Name | Description
Create(Document, ExternalResourceReference, RevitLinkOptions) |  Creates a new Revit link type from an external resource reference and loads the linked document.
Create(Document, ModelPath, RevitLinkOptions) |  Creates a new Revit link type and loads the linked document.
Top
See Also
Reference
RevitLinkType Class
Autodesk.Revit.DB Namespace